app/views/users/show.slim

  h3 #{@user.username}'s Pets
  - @user.pets.each do |pet|
---
SELECT  "pets".* FROM "pets" WHERE "pets"."user_id" = $1 ORDER BY "pets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]

    div.age= time_alive(@pet)
    - pet.pet_stats.each do |pet_stat|
      div #{pet_stat.stat.name}: #{pet_stat.value}
---
SELECT "pet_stats".* FROM "pet_stats" WHERE "pet_stats"."pet_id" = $1  [["pet_id", 1]]
SELECT  "stats".* FROM "stats" WHERE "stats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]