app/controllers/pets_controller.rb

  def new
    @pet = Pet.new
    @species = Species.all
    @colors = Color.all
    @stats = Stat.all
---
SELECT "species".* FROM "species"
SELECT "colors".* FROM "colors"
SELECT "stats".* FROM "stats"

  def create
    @pet = Pet.new(pet_params)
    @species = Species.all
    @colors = Color.all
    @stats = Stat.all
---
SELECT "species".* FROM "species"
SELECT "colors".* FROM "colors"
SELECT "stats".* FROM "stats"