app/controllers/users_controller.rb

  def show
    @user = User.find(params[:id])
    @pet = Pet.find_by(user_id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "pets".* FROM "pets" WHERE "pets"."user_id" = $1 ORDER BY "pets"."id" ASC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]